11/data/attachments/98955a337c9fa5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_71a19caf-7aa7-42c1-be50-e2ef7b956cd0</nif:username>
            <nif:friendToBeAdded>Justin_trip_Friend_97634_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>